In [97]:
import pandas as pd
import numpy as np

In [98]:
data=pd.read_csv("zomato.csv",encoding='latin-1')
data.head()

,Restaurant ID,Restaurant Name,Country Code,City,Address,Locality,Locality Verbose,Longitude,Latitude,Cuisines,...,Currency,Has Table booking,Has Online delivery,Is delivering now,Switch to order menu,Price range,Aggregate rating,Rating color,Rating text,Votes
0,6317637,Le Petit Souffle,162,Makati City,"Third Floor, Century City Mall, Kalayaan Avenu...","Century City Mall, Poblacion, Makati City","Century City Mall, Poblacion, Makati City, Mak...",121.027535,14.565443,"French, Japanese, Desserts",...,Botswana Pula(P),Yes,No,No,No,3,4.8,Dark Green,Excellent,314
1,6304287,Izakaya Kikufuji,162,Makati City,"Little Tokyo, 2277 Chino Roces Avenue, Legaspi...","Little Tokyo, Legaspi Village, Makati City","Little Tokyo, Legaspi Village, Makati City, Ma...",121.014101,14.553708,Japanese,...,Botswana Pula(P),Yes,No,No,No,3,4.5,Dark Green,Excellent,591
2,6300002,Heat - Edsa Shangri-La,162,Mandaluyong City,"Edsa Shangri-La, 1 Garden Way, Ortigas, Mandal...","Edsa Shangri-La, Ortigas, Mandaluyong City","Edsa Shangri-La, Ortigas, Mandaluyong City, Ma...",121.056831,14.581404,"Seafood, Asian, Filipino, Indian",...,Botswana Pula(P),Yes,No,No,No,4,4.4,Green,Very Good,270
3,6318506,Ooma,162,Mandaluyong City,"Third Floor, Mega Fashion Hall, SM Megamall, O...","SM Megamall, Ortigas, Mandaluyong City","SM Megamall, Ortigas, Mandaluyong City, Mandal...",121.056475,14.585318,"Japanese, Sushi",...,Botswana Pula(P),No,No,No,No,4,4.9,Dark Green,Excellent,365
4,6314302,Sambo Kojin,162,Mandaluyong City,"Third Floor, Mega Atrium, SM Megamall, Ortigas...","SM Megamall, Ortigas, Mandaluyong City","SM Megamall, Ortigas, Mandaluyong City, Mandal...",121.057508,14.584450,"Japanese, Korean",...,Botswana Pula(P),Yes,No,No,No,4,4.8,Dark Green,Excellent,229

In [99]:
data.shape

(9551, 21)

In [100]:
data.columns

Index(['Restaurant ID', 'Restaurant Name', 'Country Code', 'City', 'Address',
       'Locality', 'Locality Verbose', 'Longitude', 'Latitude', 'Cuisines',
       'Average Cost for two', 'Currency', 'Has Table booking',
       'Has Online delivery', 'Is delivering now', 'Switch to order menu',
       'Price range', 'Aggregate rating', 'Rating color', 'Rating text',
       'Votes'],
      dtype='object')

In [101]:
data.drop(columns=['Restaurant ID','Is delivering now'],inplace=True)

In [102]:
# After Removing Columns

data.columns

Index(['Restaurant Name', 'Country Code', 'City', 'Address', 'Locality',
       'Locality Verbose', 'Longitude', 'Latitude', 'Cuisines',
       'Average Cost for two', 'Currency', 'Has Table booking',
       'Has Online delivery', 'Switch to order menu', 'Price range',
       'Aggregate rating', 'Rating color', 'Rating text', 'Votes'],
      dtype='object')

In [103]:
# Exploratory Data Analysis

In [104]:
data['Country Code'].value_counts()

1      8652
216     434
215      80
214      60
30       60
189      60
148      40
208      34
14       24
162      22
94       21
191      20
166      20
184      20
37        4
Name: Country Code, dtype: int64

In [105]:
# Removing all countries expect 1

mask=data['Country Code']==1
data=data[mask]

In [106]:
data.shape

(8652, 19)

In [107]:
data.drop(columns=['Country Code','Currency'],inplace=True)

In [108]:
data.columns

Index(['Restaurant Name', 'City', 'Address', 'Locality', 'Locality Verbose',
       'Longitude', 'Latitude', 'Cuisines', 'Average Cost for two',
       'Has Table booking', 'Has Online delivery', 'Switch to order menu',
       'Price range', 'Aggregate rating', 'Rating color', 'Rating text',
       'Votes'],
      dtype='object')

In [109]:
data['City'].value_counts()

New Delhi       5473
Gurgaon         1118
Noida           1080
Faridabad        251
Ghaziabad         25
Lucknow           21
Bhubaneshwar      21
Ahmedabad         21
Guwahati          21
Amritsar          21
Kolkata           20
Nagpur            20
Bangalore         20
Vizag             20
Agra              20
Mysore            20
Allahabad         20
Patna             20
Indore            20
Mumbai            20
Kanpur            20
Surat             20
Chennai           20
Pune              20
Bhopal            20
Jaipur            20
Aurangabad        20
Kochi             20
Mangalore         20
Coimbatore        20
Dehradun          20
Varanasi          20
Nashik            20
Vadodara          20
Ludhiana          20
Puducherry        20
Goa               20
Ranchi            20
Chandigarh        18
Hyderabad         18
Secunderabad       2
Panchkula          1
Mohali             1
Name: City, dtype: int64

In [110]:
mask=data['City'].isin(['New Delhi','Gurgaon','Noida'])
data=data[mask]
data.shape

(7671, 17)

In [111]:
data.columns

Index(['Restaurant Name', 'City', 'Address', 'Locality', 'Locality Verbose',
       'Longitude', 'Latitude', 'Cuisines', 'Average Cost for two',
       'Has Table booking', 'Has Online delivery', 'Switch to order menu',
       'Price range', 'Aggregate rating', 'Rating color', 'Rating text',
       'Votes'],
      dtype='object')

In [112]:
data.drop(columns={'Restaurant Name','Address', 'Locality', 'Locality Verbose','Rating color', 'Rating text'},inplace=True)

In [113]:
data.columns

Index(['City', 'Longitude', 'Latitude', 'Cuisines', 'Average Cost for two',
       'Has Table booking', 'Has Online delivery', 'Switch to order menu',
       'Price range', 'Aggregate rating', 'Votes'],
      dtype='object')

In [114]:
data['Has Table booking'].value_counts()

No     6640
Yes    1031
Name: Has Table booking, dtype: int64

In [115]:
data['Has Online delivery'].value_counts()

No     5393
Yes    2278
Name: Has Online delivery, dtype: int64

In [116]:
data['Has Online delivery'].replace('Yes',1,inplace=True)
data['Has Online delivery'].replace('No',0,inplace=True)

In [117]:
data['Has Online delivery'].value_counts()

0    5393
1    2278
Name: Has Online delivery, dtype: int64

In [118]:
data['Has Table booking'].replace('Yes',1,inplace=True)
data['Has Table booking'].replace('No',0,inplace=True)

In [119]:
data['Has Table booking'].value_counts()

0    6640
1    1031
Name: Has Table booking, dtype: int64

In [120]:
data['Switch to order menu'].value_counts()

No    7671
Name: Switch to order menu, dtype: int64

In [121]:
data.drop(columns=['Switch to order menu'],inplace=True)

In [122]:
data.columns

Index(['City', 'Longitude', 'Latitude', 'Cuisines', 'Average Cost for two',
       'Has Table booking', 'Has Online delivery', 'Price range',
       'Aggregate rating', 'Votes'],
      dtype='object')

In [123]:
data['Cuisines'].value_counts()

North Indian                           873
North Indian, Chinese                  447
Fast Food                              320
Chinese                                314
North Indian, Mughlai                  303
                                      ...
Asian, Continental, Fast Food            1
Cafe, Pizza, Italian                     1
European, Desserts                       1
Mediterranean, Continental, Italian      1
Chinese, North Eastern                   1
Name: Cuisines, Length: 1143, dtype: int64

In [124]:
data.corr()

,Longitude,Latitude,Average Cost for two,Has Table booking,Has Online delivery,Price range,Aggregate rating,Votes
Longitude,1.000000,0.997721,0.071854,0.059863,0.138230,0.082031,0.221801,0.071482
Latitude,0.997721,1.000000,0.070816,0.060228,0.137746,0.081059,0.221399,0.071196
Average Cost for two,0.071854,0.070816,1.000000,0.643845,0.072198,0.848425,0.329785,0.297741
Has Table booking,0.059863,0.060228,0.643845,1.000000,0.072631,0.661477,0.251972,0.224377
Has Online delivery,0.138230,0.137746,0.072198,0.072631,1.000000,0.184855,0.339658,0.121491
Price range,0.082031,0.081059,0.848425,0.661477,0.184855,1.000000,0.372624,0.325489
Aggregate rating,0.221801,0.221399,0.329785,0.251972,0.339658,0.372624,1.000000,0.291500
Votes,0.071482,0.071196,0.297741,0.224377,0.121491,0.325489,0.291500,1.000000

In [125]:
data.corr()['Average Cost for two']

Longitude               0.071854
Latitude                0.070816
Average Cost for two    1.000000
Has Table booking       0.643845
Has Online delivery     0.072198
Price range             0.848425
Aggregate rating        0.329785
Votes                   0.297741
Name: Average Cost for two, dtype: float64

In [126]:
data.drop(columns=['Longitude','Latitude','Has Online delivery','Price range'],inplace=True)

In [127]:
data

,City,Cuisines,Average Cost for two,Has Table booking,Aggregate rating,Votes
1161,Gurgaon,"Cafe, Beverages",350,0,3.4,16
1162,Gurgaon,"North Indian, Mughlai",800,1,2.7,80
1163,Gurgaon,"North Indian, Mughlai",2000,1,4.3,1887
1164,Gurgaon,"South Indian, Seafood, Kerala",1400,1,4.0,802
1165,Gurgaon,Bakery,250,0,3.0,4
...,...,...,...,...,...,...
9108,Noida,"North Indian, Chinese",700,0,2.6,34
9109,Noida,Fast Food,400,0,0.0,1
9110,Noida,Fast Food,600,0,0.0,3
9111,Noida,"North Indian, Chinese",500,0,0.0,0
9112,Noida,"Raw Meats, Fast Food",250,0,0.0,1

In [128]:
cuisine=data.groupby('Cuisines')['Average Cost for two'].mean().reset_index()
cuisine

                                       Cuisines  Average Cost for two
0                                       Afghani            512.500000
1                     Afghani, Mughlai, Chinese            500.000000
2                         Afghani, North Indian            900.000000
3     Afghani, North Indian, Pakistani, Arabian            500.000000
4                                      American            666.666667
...                                         ...                   ...
1138                       Tibetan, Street Food            100.000000
1139                                    Turkish            600.000000
1140       Turkish, Arabian, Moroccan, Lebanese            400.000000
1141     Turkish, Mediterranean, Middle Eastern           2000.000000
1142                                 Vietnamese           1000.000000

[1143 rows x 2 columns]

In [129]:
new_data=data.merge(cuisine, on='Cuisines')
new_data

,City,Cuisines,Average Cost for two_x,Has Table booking,Aggregate rating,Votes,Average Cost for two_y
0,Gurgaon,"Cafe, Beverages",350,0,3.4,16,416.666667
1,New Delhi,"Cafe, Beverages",200,0,0.0,0,416.666667
2,New Delhi,"Cafe, Beverages",700,0,4.1,92,416.666667
3,Gurgaon,"North Indian, Mughlai",800,1,2.7,80,755.511551
4,Gurgaon,"North Indian, Mughlai",2000,1,4.3,1887,755.511551
...,...,...,...,...,...,...,...
7666,Noida,"European, North Indian, Chinese",2500,1,2.2,116,2500.000000
7667,Noida,"Juices, Beverages, Fast Food",200,0,3.0,10,200.000000
7668,Noida,"Bakery, Desserts, Fast Food, North Indian",450,0,3.5,105,450.000000
7669,Noida,"Continental, Lebanese, Mexican",1000,1,0.0,0,1000.000000
7670,Noida,"Chinese, North Indian, South Indian, Fast Food",450,0,2.0,161,450.000000

In [130]:
new_data.drop(columns={'Cuisines'},inplace=True)
new_data.head()

,City,Average Cost for two_x,Has Table booking,Aggregate rating,Votes,Average Cost for two_y
0,Gurgaon,350,0,3.4,16,416.666667
1,New Delhi,200,0,0.0,0,416.666667
2,New Delhi,700,0,4.1,92,416.666667
3,Gurgaon,800,1,2.7,80,755.511551
4,Gurgaon,2000,1,4.3,1887,755.511551

In [131]:
new_data.rename(columns={'Average Cost for two_x':'cost','Average Cost for two_y':'cuisine'},inplace=True)

In [132]:
new_data=new_data[['City','Has Table booking','Aggregate rating','Votes','cuisine','cost']]

In [133]:
new_data.head()

        City  Has Table booking  Aggregate rating  Votes     cuisine  cost
0    Gurgaon                  0               3.4     16  416.666667   350
1  New Delhi                  0               0.0      0  416.666667   200
2  New Delhi                  0               4.1     92  416.666667   700
3    Gurgaon                  1               2.7     80  755.511551   800
4    Gurgaon                  1               4.3   1887  755.511551  2000

In [134]:
X=new_data.iloc[:,:-1].values
X

array([['Gurgaon', 0, 3.4, 16, 416.6666666666667],
       ['New Delhi', 0, 0.0, 0, 416.6666666666667],
       ['New Delhi', 0, 4.1, 92, 416.6666666666667],
       ...,
       ['Noida', 0, 3.5, 105, 450.0],
       ['Noida', 1, 0.0, 0, 1000.0],
       ['Noida', 0, 2.0, 161, 450.0]], dtype=object)

In [135]:
y=new_data.iloc[:,-1].values
y

array([ 350,  200,  700, ...,  450, 1000,  450], dtype=int64)

In [136]:
from sklearn.preprocessing import LabelEncoder
encoder=LabelEncoder()

In [137]:
X[:, 0]=encoder.fit_transform(X[:, 0])
X

array([[0, 0, 3.4, 16, 416.6666666666667],
       [1, 0, 0.0, 0, 416.6666666666667],
       [1, 0, 4.1, 92, 416.6666666666667],
       ...,
       [2, 0, 3.5, 105, 450.0],
       [2, 1, 0.0, 0, 1000.0],
       [2, 0, 2.0, 161, 450.0]], dtype=object)

In [138]:
X.shape

(7671, 5)

In [139]:
from sklearn.preprocessing import OneHotEncoder
from sklearn.compose import ColumnTransformer
onecoder = ColumnTransformer([("encoder", OneHotEncoder(), [0])], remainder = 'passthrough')
X=onecoder.fit_transform(X)

X.shape

(7671, 7)

In [140]:
X=X[:,1:]
X.shape

(7671, 6)

In [141]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.2,random_state=9)

In [142]:
from sklearn.linear_model import LinearRegression
regressor=LinearRegression()

In [143]:
regressor.fit(X_train,y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [144]:
y_pred=regressor.predict(X_test)

In [145]:
from sklearn.metrics import r2_score
r2_score(y_test,y_pred)

0.7189272138600126